{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "batch_input_shape": [null, 64, 64, 3], "bias_regularizer": null, "filters": 32, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "name": "conv2d_1", "strides": [1, 1], "dtype": "float32", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "filters": 32, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 128, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1", "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 1, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2", "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.5"}